In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

## describe

In [2]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [3]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## unique

In [4]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [5]:
np.array(dict(enumerate(df["race"].unique())))    # dict type 으로 index

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [6]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:,0].tolist()))
key = np.array(list(enumerate(df['race'].unique())),dtype=str)[:,1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [7]:
df["race"].replace(to_replace=key, value=value, inplace=True)

In [8]:
value = list(map(int, np.array(list(enumerate(df['sex'].unique())))[:,0].tolist()))
key = np.array(list(enumerate(df['sex'].unique())),dtype=str)[:,1].tolist()

value, key

([0, 1], ['male', 'female'])

In [13]:
df["sex"].replace(to_replace=key, value=value, inplace=True)
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

## Sum

In [10]:
df.sum(axis=0)   # column 별

earn                                          44743437.5254
height                                             91831.25
sex       malefemalefemalefemalefemalefemalefemalemalema...
race                                                    561
ed                                                    18416
age                                                   62508
dtype: object

In [11]:
df.sum(axis=1)    # row 별

0       79710.189011
1       96541.218643
2       48823.436947
3       80653.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

## isnull

In [14]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

In [13]:
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

## sort_values

In [15]:
df.sort_values(["age","earn"], ascending=True).head(10)

             earn  height     sex  race  ed  age
1038   -56.321979   67.81    male     2  10   22
800    -27.876819   72.29    male     0  12   22
963    -25.655260   68.90    male     0  12   22
1105   988.565070   64.71  female     0  12   22
801   1000.221504   64.09  female     0  12   22
862   1002.023843   66.59  female     0  12   22
933   1007.994941   68.26  female     0  12   22
988   1578.542814   64.53    male     0  12   22
522   1955.168187   69.87  female     3  12   22
765   2581.870402   64.79  female     0  12   22

In [16]:
df.cumsum().head(5)

            earn  height                           sex  race  ed  age
0   79571.299011   73.89                          male     0  16   49
1  175968.287654  140.12                    malefemale     0  32  111
2  224678.954602  203.89              malefemalefemale     0  48  144
3  305157.050754  267.11        malefemalefemalefemale     1  64  239
4  387246.396253  330.19  malefemalefemalefemalefemale     1  81  282

In [17]:
df.cummax().head(10)

           earn  height   sex  race  ed  age
0  79571.299011   73.89  male     0  16   49
1  96396.988643   73.89  male     0  16   62
2  96396.988643   73.89  male     0  16   62
3  96396.988643   73.89  male     1  16   95
4  96396.988643   73.89  male     1  17   95
5  96396.988643   73.89  male     1  17   95
6  96396.988643   73.89  male     1  17   95
7  96396.988643   73.89  male     1  17   95
8  96396.988643   73.89  male     2  17   95
9  96396.988643   73.89  male     2  17   95

In [18]:
df.sort_values("age", ascending=False).head(10)

              earn  height     sex  race  ed  age
3     80478.096153   63.22  female     1  16   95
331   39169.750135   64.79  female     0  12   95
809   42963.362005   72.94    male     0  12   95
102   39751.194030   67.14    male     0  12   93
993   32809.632677   59.61  female     1  16   92
1017   8942.806716   62.97  female     0  10   91
1192  39757.947210   64.79    male     0  16   90
952    8162.682672   58.09  female     0   5   89
827   55712.348432   70.13    male     0   9   88
1068  10861.092284   64.03  female     0  13   87

## Correlation & Covariance

In [19]:
df.age.corr(df.earn)

0.07400349177836055

In [23]:
df.age[df.age<55].corr(df.earn)

0.29378871716236815

In [27]:
df.age[(df.age<55) & (df.age>15)].corr(df.earn)

0.29378871716236815

In [20]:
df.age.cov(df.earn)

36523.69921040889

In [21]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [22]:
df.corr()

            earn    height      race        ed       age
earn    1.000000  0.291600 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.045974  0.114047 -0.133727
race   -0.063977 -0.045974  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727 -0.056879 -0.129802  1.000000

In [28]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [29]:
df.sex.value_counts(sort=True)

female    859
male      520
Name: sex, dtype: int64